/**
 * Масиви
 *
 * - Створення масиву
 * - Доступ до елементів
 * - Перевизначення значення елемента
 * - Довжина масиву
 * - Індекс останнього елемента
 * - Перевизначення
 */

// const x = [1, 2, 3, 45];

// x[2] = 'Hello';

// x[50] = 'Hello world';

// const sum = x[0] + x[1];

// console.log(x);
//!======================================================

// const arr = [3, 46, 8, 2];

// console.log(arr.length);
//!======================================================

// const arr = [1, 3, 5, 1];

// arr[arr.length - 1] = 'THE END';

// console.log(arr);
//!======================================================
