/**
 * Передача за посиланням і за значенням
 *
 * Примітиви і складні типи
 * Посилальна рівність (referential equality)
 */

// const x = ['Hello', 'World'];

// const y = x;

// y[2] = 'THE END';

// console.log(x);
// console.log(y);
// console.log(x === y);
//!======================================================

// const x = [1, 2];
// const y = [1, 2];

// console.log(x === y);

//!======================================================
// const x = [
//   [1, 2, 3],
//   [5, 6, 7],
// ];

// x[0][0];
//!======================================================
